# SetHorizSecCutPlane

```pascal
FUNCTION SetHorizSecCutPlane(
				hObject        : HANDLE;
				objectCutPlane : INTEGER): BOOLEAN;
```

```python
def vs.SetHorizSecCutPlane(hObject, objectCutPlane):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |
|objectCutPlane|INTEGER|   |

## Version
Availability: from Vectorworks 2020

## Category
* Objects - Custom